app/controllers/admin/customers_controller.rb

  def update
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]