app/controllers/admin/genres_controller.rb

  def update
    @genre = Genre.find(params[:id])
    @genre.update(genre_params)
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "genres" SET "genre_name" = ?, "updated_at" = ? WHERE "genres"."id" = ?  [["genre_name", "アイス"], ["updated_at", "2021-12-13 10:26:42.546573"], ["id", 1]]

  def create
    @genre = Genre.new(genre_params)
    @genre.save
---
INSERT INTO "genres" ("created_at", "updated_at", "genre_name") VALUES (?, ?, ?)  [["created_at", "2022-03-21 07:22:11.353700"], ["updated_at", "2022-03-21 07:22:11.353700"], ["genre_name", "アイス"]]