app/controllers/admin/items_controller.rb

SELECT "genres".* FROM "genres"
---
  def new
    @item = Item.new
    @genres = Genre.all

INSERT INTO "items" ("genre_id", "name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "genres".* FROM "genres"
---
  def edit
    @item = Item.find(params[:id])
    @genres = Genre.all

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "price" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "f9c2aeec8f284eb61c9b1843bd33142e1fe7178d4f34f3bbf9b97778fb18"], ["price", 1201], ["updated_at", "2022-01-29 10:51:25.425054"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    @item.update!(item_params)