app/views/admin/homes/top.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
      <td><%= link_to order.created_at, order_path(order.id) %></td>
      <td><%= order.customer.last_name + order.customer.first_name %></td>

SELECT "orders".* FROM "orders"
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 9]]
---
        <% @sum=0 %>
        <% order.order_details.each do |detail| %>