app/controllers/public/addresses_controller.rb

  def index
      @address = Address.new
      @addresses = Address.all
---
SELECT "addresses".* FROM "addresses"

  def create
    @address = Address.new(address_params)
    @address.customer_id = current_customer.id
    @address.save
---
INSERT INTO "addresses" ("customer_id", "name", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["customer_id", 1], ["name", "aaadddd"], ["postal_code", "11111111"], ["address", "aaaaaaaa"], ["created_at", "2022-01-27 12:19:36.588618"], ["updated_at", "2022-01-27 12:19:36.588618"]]

  def update
    @address = Address.find(params[:id])
    @address.update(address_params)
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "addresses" SET "postal_code" = ?, "updated_at" = ? WHERE "addresses"."id" = ?  [["postal_code", "11111112"], ["updated_at", "2022-01-29 04:26:38.715699"], ["id", 1]]

  def destroy
    address = Address.find(params[:id])
    address.destroy
---
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]