app/controllers/public/cart_items_controller.rb

SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ? AND "cart_items"."item_id" = ? LIMIT ?  [["customer_id", 1], ["item_id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 3], ["updated_at", "2022-01-31 12:32:07.563212"], ["id", 12]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 1], ["updated_at", "2022-01-31 11:49:58.623427"], ["id", 7]]
INSERT INTO "cart_items" ("item_id", "customer_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["item_id", 1], ["customer_id", 1], ["amount", 1], ["created_at", "2022-01-31 12:31:55.357228"], ["updated_at", "2022-01-31 12:31:55.357228"]]
---
  def create
    @cart_item = current_customer.cart_items.find_by(item_id: params[:cart_item][:item_id])
    if @cart_item.present?
      @cart_item.amount += params[:cart_item][:amount].to_i
      @cart_item.update(amount: @cart_item.amount)
    else
      @cart_item = CartItem.new(cart_item_params)
      @cart_item.customer_id = current_customer.id
      @cart_item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = ?, "updated_at" = ? WHERE "cart_items"."id" = ?  [["amount", 5], ["updated_at", "2022-01-31 12:32:12.947025"], ["id", 12]]
---
  def update
    @cart_item = CartItem.find(params[:id])
    @cart_item.update(cart_item_params)

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 12]]
---
  def destroy_all
    @cart_items = CartItem.where(customer_id: current_customer.id)
    @cart_items.destroy_all