app/controllers/public/customers_controller.rb

  def show
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def update
    @customer = current_customer
    @customer.update(customer_params)
---
UPDATE "customers" SET "email" = ?, "last_name" = ?, "first_name" = ?, "last_name_kana" = ?, "first_name_kana" = ?, "postal_code" = ?, "address" = ?, "telephone_number" = ?, "updated_at" = ? WHERE "customers"."id" = ?