app/controllers/public/customers_controller.rb

  def seeyou
    current_customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-03-28 08:48:53.353530"], ["id", 4]]