app/controllers/public/orders_controller.rb

  def create
    @cart_items = current_customer.cart_items
    @order = current_customer.orders.new(order_params)
    @order.save
    @cart_items.each do |cart_item|
      @order_detail = @order.order_details.new
      @order_detail.item_id = cart_item.item.id
      @order_detail.price = cart_item.item.price
      @order_detail.amount = cart_item.amount
      @order_detail.save
    end
    @cart_items.destroy_all
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 3]]
INSERT INTO "orders" ("customer_id", "address", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["address", "123456789"], ["name", "aa"], ["created_at", "2022-02-12 05:56:36.064309"], ["updated_at", "2022-02-12 05:56:36.064309"]]
INSERT INTO "order_details" ("order_id", "item_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["order_id", 8], ["item_id", 1], ["price", 1201], ["amount", 1], ["created_at", "2022-03-17 12:17:08.078678"], ["updated_at", "2022-03-17 12:17:08.078678"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 26]]

  def check
    @order = Order.new(order_params)
    @order.shipping_cost = 800
    @cart_items = current_customer.cart_items

    if params[:order][:address_number] == "1"
      @order.name = current_customer.last_name + current_customer.first_name
      @order.address = current_customer.address
      @order.postal_code = current_customer.postal_code
    elsif params[:order][:address_number] == "2"
      @address_new = current_customer.addresses.new(address_params)
      @address_new.save
      @order.name = current_customer.last_name + current_customer.first_name
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 3]]

  def index
    @orders = current_customer.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."customer_id" = ?  [["customer_id", 3]]

  def show
    @order = Order.find(params[:id])
    @order_details = @order.order_details
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE "order_details"."order_id" = ?  [["order_id", 9]]